### List of Changed Stacks

```bash
stacks/client-1
stacks/original
exitcode=0
stdout<<EOF
stacks/client-1
stacks/original
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.master_instance must be replaced
-/+ resource "aws_instance" "master_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-0d1df3d631fd7a83c" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1e" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0d1df3d631fd7a83c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0fcfac9fd5d3d7607" -> (known after apply)
      ~ private_dns                          = "ip-172-31-152-116.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.152.116" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          - "original_implementation_master_sg",
        ] -> (known after apply) # forces replacement
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Client" = "original_implementation"
            "Name"   = "original_implementation_master_instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-086d333a95534d39e",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0f09da8dd9a51fa09" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_launch_template.slave_launch_template will be updated in-place
  ~ resource "aws_launch_template" "slave_launch_template" {
        id                      = "lt-0d1bc0232e59d73bc"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "original_implementation_template20240509214509987000000002"
        tags                    = {}
      ~ vpc_security_group_ids  = [
          - "sg-0f86902cabd58bad7",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.master_sg will be destroyed
  # (because aws_security_group.master_sg is not in configuration)
  - resource "aws_security_group" "master_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-086d333a95534d39e" -> null
      - description            = "Allow inbound traffic and all outbound traffic to the master of original_implementation" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f86902cabd58bad7",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-086d333a95534d39e" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0f86902cabd58bad7",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "original_implementation_master_sg" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Client" = "original_implementation"
          - "Name"   = "original_implementation_master_sg"
        } -> null
      - tags_all               = {
          - "Client" = "original_implementation"
          - "Name"   = "original_implementation_master_sg"
        } -> null
      - vpc_id                 = "vpc-07d4e8828e405ba5b" -> null
    }

  # aws_security_group.master_sg_original will be created
  + resource "aws_security_group" "master_sg_original" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic and all outbound traffic to the master of original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_master_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_master_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # aws_security_group.slave_sg will be destroyed
  # (because aws_security_group.slave_sg is not in configuration)
  - resource "aws_security_group" "slave_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group/sg-0f86902cabd58bad7" -> null
      - description            = "Segurity group for the slave structure of the client original_implementation" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Egress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-086d333a95534d39e",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0f86902cabd58bad7" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress rule that allow the slave to communicate with the master instance"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-086d333a95534d39e",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "original_implementation_slave_sg" -> null
      - owner_id               = "295093822487" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Client" = "original_implementation"
          - "Name"   = "original_implementation_slave_sg"
        } -> null
      - tags_all               = {
          - "Client" = "original_implementation"
          - "Name"   = "original_implementation_slave_sg"
        } -> null
      - vpc_id                 = "vpc-07d4e8828e405ba5b" -> null
    }

  # aws_security_group.slave_sg_original will be created
  + resource "aws_security_group" "slave_sg_original" {
      + arn                    = (known after apply)
      + description            = "Segurity group for the slave structure of the client original_implementation"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "original_implementation_slave_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + tags_all               = {
          + "Client" = "original_implementation"
          + "Name"   = "original_implementation_slave_sg"
        }
      + vpc_id                 = "vpc-07d4e8828e405ba5b"
    }

  # aws_vpc_security_group_egress_rule.allow_slave_egress must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "allow_slave_egress" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-08ab0b518b2bb1914" -> (known after apply)
      ~ id                           = "sgr-08ab0b518b2bb1914" -> (known after apply)
      ~ referenced_security_group_id = "sg-0f86902cabd58bad7" -> (known after apply)
      ~ security_group_id            = "sg-086d333a95534d39e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-08ab0b518b2bb1914" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_vpc_security_group_egress_rule.egress_from_master_sg must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "egress_from_master_sg" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-09d71aed6a3ef6c88" -> (known after apply)
      ~ id                           = "sgr-09d71aed6a3ef6c88" -> (known after apply)
      ~ referenced_security_group_id = "sg-086d333a95534d39e" -> (known after apply)
      ~ security_group_id            = "sg-0f86902cabd58bad7" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-09d71aed6a3ef6c88" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.allow_internet_traffic_global must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_internet_traffic_global" {
      ~ arn                    = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-0617a3cef33eb2e80" -> (known after apply)
      ~ id                     = "sgr-0617a3cef33eb2e80" -> (known after apply)
      ~ security_group_id      = "sg-086d333a95534d39e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0617a3cef33eb2e80" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.allow_slave_ingress must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "allow_slave_ingress" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-09fd6845fb8952b93" -> (known after apply)
      ~ id                           = "sgr-09fd6845fb8952b93" -> (known after apply)
      ~ referenced_security_group_id = "sg-0f86902cabd58bad7" -> (known after apply)
      ~ security_group_id            = "sg-086d333a95534d39e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-09fd6845fb8952b93" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.ingress_from_master_sg must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "ingress_from_master_sg" {
      ~ arn                          = "arn:aws:ec2:us-east-1:295093822487:security-group-rule/sgr-04ead173c7667aa3b" -> (known after apply)
      ~ id                           = "sgr-04ead173c7667aa3b" -> (known after apply)
      ~ referenced_security_group_id = "sg-086d333a95534d39e" -> (known after apply)
      ~ security_group_id            = "sg-0f86902cabd58bad7" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-04ead173c7667aa3b" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 8 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->